MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1907/mcu.h
// Register: RC1REG
#define RC1REG RC1REG
extern volatile unsigned char           RC1REG              __at(0x199);
#ifndef _LIB_BUILD
asm("RC1REG equ 0199h");
#endif
// aliases
extern volatile unsigned char           RCREG               __at(0x199);
#ifndef _LIB_BUILD
asm("RCREG equ 0199h");
#endif
extern volatile unsigned char           RCREG1              __at(0x199);
#ifndef _LIB_BUILD
asm("RCREG1 equ 0199h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC1REG                 :8;
    };
} RC1REGbits_t;
extern volatile RC1REGbits_t RC1REGbits __at(0x199);
// bitfield macros
#define _RC1REG_RC1REG_POSN                                 0x0
#define _RC1REG_RC1REG_POSITION                             0x0
#define _RC1REG_RC1REG_SIZE                                 0x8
#define _RC1REG_RC1REG_LENGTH                               0x8
#define _RC1REG_RC1REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RC1REG                 :8;
    };
} RCREGbits_t;
extern volatile RCREGbits_t RCREGbits __at(0x199);
// bitfield macros
#define _RCREG_RC1REG_POSN                                  0x0
#define _RCREG_RC1REG_POSITION                              0x0
#define _RCREG_RC1REG_SIZE                                  0x8
#define _RCREG_RC1REG_LENGTH                                0x8
#define _RCREG_RC1REG_MASK                                  0xFF
typedef union {
    struct {
        unsigned RC1REG                 :8;
    };
} RCREG1bits_t;
extern volatile RCREG1bits_t RCREG1bits __at(0x199);
// bitfield macros
#define _RCREG1_RC1REG_POSN                                 0x0
#define _RCREG1_RC1REG_POSITION                             0x0
#define _RCREG1_RC1REG_SIZE                                 0x8
#define _RCREG1_RC1REG_LENGTH                               0x8
#define _RCREG1_RC1REG_MASK                                 0xFF

// Register: TX1REG
#define TX1REG TX1REG
extern volatile unsigned char           TX1REG              __at(0x19A);
#ifndef _LIB_BUILD
asm("TX1REG equ 019Ah");
#endif
// aliases
extern volatile unsigned char           TXREG               __at(0x19A);
#ifndef _LIB_BUILD
asm("TXREG equ 019Ah");
#endif
extern volatile unsigned char           TXREG1              __at(0x19A);
#ifndef _LIB_BUILD
asm("TXREG1 equ 019Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX1REG                 :8;
    };
} TX1REGbits_t;
extern volatile TX1REGbits_t TX1REGbits __at(0x19A);
// bitfield macros
#define _TX1REG_TX1REG_POSN                                 0x0
#define _TX1REG_TX1REG_POSITION                             0x0
#define _TX1REG_TX1REG_SIZE                                 0x8
#define _TX1REG_TX1REG_LENGTH                               0x8
#define _TX1REG_TX1REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX1REG                 :8;
    };
} TXREGbits_t;
extern volatile TXREGbits_t TXREGbits __at(0x19A);
// bitfield macros
#define _TXREG_TX1REG_POSN                                  0x0
#define _TXREG_TX1REG_POSITION                              0x0
#define _TXREG_TX1REG_SIZE                                  0x8
#define _TXREG_TX1REG_LENGTH                                0x8
#define _TXREG_TX1REG_MASK                                  0xFF
typedef union {
    struct {
        unsigned TX1REG                 :8;
    };
} TXREG1bits_t;
extern volatile TXREG1bits_t TXREG1bits __at(0x19A);
// bitfield macros
#define _TXREG1_TX1REG_POSN                                 0x0
#define _TXREG1_TX1REG_POSITION                             0x0
#define _TXREG1_TX1REG_SIZE                                 0x8
#define _TXREG1_TX1REG_LENGTH                               0x8
#define _TXREG1_TX1REG_MASK                                 0xFF

// Register: SP1BRG
#define SP1BRG SP1BRG
extern volatile unsigned short          SP1BRG              __at(0x19B);
#ifndef _LIB_BUILD
asm("SP1BRG equ 019Bh");
#endif

// Register: SP1BRGL
#define SP1BRGL SP1BRGL
extern volatile unsigned char           SP1BRGL             __at(0x19B);
#ifndef _LIB_BUILD
asm("SP1BRGL equ 019Bh");
#endif
// aliases
extern volatile unsigned char           SPBRG               __at(0x19B);
#ifndef _LIB_BUILD
asm("SPBRG equ 019Bh");
#endif
extern volatile unsigned char           SPBRGL1             __at(0x19B);
#ifndef _LIB_BUILD
asm("SPBRGL1 equ 019Bh");
#endif
extern volatile unsigned char           SPBRGL              __at(0x19B);
#ifndef _LIB_BUILD
asm("SPBRGL equ 019Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPGRGL                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SP1BRGLbits_t;
extern volatile SP1BRGLbits_t SP1BRGLbits __at(0x19B);
// bitfield macros
#define _SP1BRGL_SPGRGL_POSN                                0x0
#define _SP1BRGL_SPGRGL_POSITION                            0x0
#define _SP1BRGL_SPGRGL_SIZE                                0x8
#define _SP1BRGL_SPGRGL_LENGTH                              0x8
#define _SP1BRGL_SPGRGL_MASK                                0xFF
#define _SP1BRGL_BRG0_POSN                                  0x0
#define _SP1BRGL_BRG0_POSITION                              0x0
#define _SP1BRGL_BRG0_SIZE                                  0x1
#define _SP1BRGL_BRG0_LENGTH                                0x1
#define _SP1BRGL_BRG0_MASK                                  0x1
#define _SP1BRGL_BRG1_POSN                                  0x1
#define _SP1BRGL_BRG1_POSITION                              0x1
#define _SP1BRGL_BRG1_SIZE                                  0x1
#define _SP1BRGL_BRG1_LENGTH                                0x1
#define _SP1BRGL_BRG1_MASK                                  0x2
#define _SP1BRGL_BRG2_POSN                                  0x2
#define _SP1BRGL_BRG2_POSITION                              0x2
#define _SP1BRGL_BRG2_SIZE                                  0x1
#define _SP1BRGL_BRG2_LENGTH                                0x1
#define _SP1BRGL_BRG2_MASK                                  0x4
#define _SP1BRGL_BRG3_POSN                                  0x3
#define _SP1BRGL_BRG3_POSITION                              0x3
#define _SP1BRGL_BRG3_SIZE                                  0x1
#define _SP1BRGL_BRG3_LENGTH                                0x1
#define _SP1BRGL_BRG3_MASK                                  0x8
#define _SP1BRGL_BRG4_POSN                                  0x4
#define _SP1BRGL_BRG4_POSITION                              0x4
#define _SP1BRGL_BRG4_SIZE                                  0x1
#define _SP1BRGL_BRG4_LENGTH                                0x1
#define _SP1BRGL_BRG4_MASK                                  0x10
#define _SP1BRGL_BRG5_POSN                                  0x5
#define _SP1BRGL_BRG5_POSITION                              0x5
#define _SP1BRGL_BRG5_SIZE                                  0x1
#define _SP1BRGL_BRG5_LENGTH                                0x1
#define _SP1BRGL_BRG5_MASK                                  0x20
#define _SP1BRGL_BRG6_POSN                                  0x6
#define _SP1BRGL_BRG6_POSITION                              0x6
#define _SP1BRGL_BRG6_SIZE                                  0x1
#define _SP1BRGL_BRG6_LENGTH                                0x1
#define _SP1BRGL_BRG6_MASK                                  0x40
#define _SP1BRGL_BRG7_POSN                                  0x7
#define _SP1BRGL_BRG7_POSITION                              0x7
#define _SP1BRGL_BRG7_SIZE                                  0x1
#define _SP1BRGL_BRG7_LENGTH                                0x1
#define _SP1BRGL_BRG7_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SPGRGL                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRGbits_t;
