MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1907/mcu.h
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0x7AA);
// bitfield macros
#define _LCDDATA10_SEG8COM3_POSN                            0x0
#define _LCDDATA10_SEG8COM3_POSITION                        0x0
#define _LCDDATA10_SEG8COM3_SIZE                            0x1
#define _LCDDATA10_SEG8COM3_LENGTH                          0x1
#define _LCDDATA10_SEG8COM3_MASK                            0x1
#define _LCDDATA10_SEG9COM3_POSN                            0x1
#define _LCDDATA10_SEG9COM3_POSITION                        0x1
#define _LCDDATA10_SEG9COM3_SIZE                            0x1
#define _LCDDATA10_SEG9COM3_LENGTH                          0x1
#define _LCDDATA10_SEG9COM3_MASK                            0x2
#define _LCDDATA10_SEG10COM3_POSN                           0x2
#define _LCDDATA10_SEG10COM3_POSITION                       0x2
#define _LCDDATA10_SEG10COM3_SIZE                           0x1
#define _LCDDATA10_SEG10COM3_LENGTH                         0x1
#define _LCDDATA10_SEG10COM3_MASK                           0x4
#define _LCDDATA10_SEG11COM3_POSN                           0x3
#define _LCDDATA10_SEG11COM3_POSITION                       0x3
#define _LCDDATA10_SEG11COM3_SIZE                           0x1
#define _LCDDATA10_SEG11COM3_LENGTH                         0x1
#define _LCDDATA10_SEG11COM3_MASK                           0x8
#define _LCDDATA10_SEG12COM3_POSN                           0x4
#define _LCDDATA10_SEG12COM3_POSITION                       0x4
#define _LCDDATA10_SEG12COM3_SIZE                           0x1
#define _LCDDATA10_SEG12COM3_LENGTH                         0x1
#define _LCDDATA10_SEG12COM3_MASK                           0x10
#define _LCDDATA10_SEG13COM3_POSN                           0x5
#define _LCDDATA10_SEG13COM3_POSITION                       0x5
#define _LCDDATA10_SEG13COM3_SIZE                           0x1
#define _LCDDATA10_SEG13COM3_LENGTH                         0x1
#define _LCDDATA10_SEG13COM3_MASK                           0x20
#define _LCDDATA10_SEG14COM3_POSN                           0x6
#define _LCDDATA10_SEG14COM3_POSITION                       0x6
#define _LCDDATA10_SEG14COM3_SIZE                           0x1
#define _LCDDATA10_SEG14COM3_LENGTH                         0x1
#define _LCDDATA10_SEG14COM3_MASK                           0x40
#define _LCDDATA10_SEG15COM3_POSN                           0x7
#define _LCDDATA10_SEG15COM3_POSITION                       0x7
#define _LCDDATA10_SEG15COM3_SIZE                           0x1
#define _LCDDATA10_SEG15COM3_LENGTH                         0x1
#define _LCDDATA10_SEG15COM3_MASK                           0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0x7AB);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 07ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16COM3              :1;
        unsigned SEG17COM3              :1;
        unsigned SEG18COM3              :1;
        unsigned SEG19COM3              :1;
        unsigned SEG20COM3              :1;
        unsigned SEG21COM3              :1;
        unsigned SEG22COM3              :1;
        unsigned SEG23COM3              :1;
    };
} LCDDATA11bits_t;
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0x7AB);
// bitfield macros
#define _LCDDATA11_SEG16COM3_POSN                           0x0
#define _LCDDATA11_SEG16COM3_POSITION                       0x0
#define _LCDDATA11_SEG16COM3_SIZE                           0x1
#define _LCDDATA11_SEG16COM3_LENGTH                         0x1
#define _LCDDATA11_SEG16COM3_MASK                           0x1
#define _LCDDATA11_SEG17COM3_POSN                           0x1
#define _LCDDATA11_SEG17COM3_POSITION                       0x1
#define _LCDDATA11_SEG17COM3_SIZE                           0x1
#define _LCDDATA11_SEG17COM3_LENGTH                         0x1
#define _LCDDATA11_SEG17COM3_MASK                           0x2
#define _LCDDATA11_SEG18COM3_POSN                           0x2
#define _LCDDATA11_SEG18COM3_POSITION                       0x2
#define _LCDDATA11_SEG18COM3_SIZE                           0x1
#define _LCDDATA11_SEG18COM3_LENGTH                         0x1
#define _LCDDATA11_SEG18COM3_MASK                           0x4
#define _LCDDATA11_SEG19COM3_POSN                           0x3
#define _LCDDATA11_SEG19COM3_POSITION                       0x3
#define _LCDDATA11_SEG19COM3_SIZE                           0x1
#define _LCDDATA11_SEG19COM3_LENGTH                         0x1
#define _LCDDATA11_SEG19COM3_MASK                           0x8
#define _LCDDATA11_SEG20COM3_POSN                           0x4
#define _LCDDATA11_SEG20COM3_POSITION                       0x4
#define _LCDDATA11_SEG20COM3_SIZE                           0x1
#define _LCDDATA11_SEG20COM3_LENGTH                         0x1
#define _LCDDATA11_SEG20COM3_MASK                           0x10
#define _LCDDATA11_SEG21COM3_POSN                           0x5
#define _LCDDATA11_SEG21COM3_POSITION                       0x5
#define _LCDDATA11_SEG21COM3_SIZE                           0x1
#define _LCDDATA11_SEG21COM3_LENGTH                         0x1
#define _LCDDATA11_SEG21COM3_MASK                           0x20
#define _LCDDATA11_SEG22COM3_POSN                           0x6
#define _LCDDATA11_SEG22COM3_POSITION                       0x6
#define _LCDDATA11_SEG22COM3_SIZE                           0x1
#define _LCDDATA11_SEG22COM3_LENGTH                         0x1
#define _LCDDATA11_SEG22COM3_MASK                           0x40
#define _LCDDATA11_SEG23COM3_POSN                           0x7
#define _LCDDATA11_SEG23COM3_POSITION                       0x7
#define _LCDDATA11_SEG23COM3_SIZE                           0x1
#define _LCDDATA11_SEG23COM3_LENGTH                         0x1
#define _LCDDATA11_SEG23COM3_MASK                           0x80

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0x7AC);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 07ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24COM0              :1;
        unsigned SEG25COM0              :1;
        unsigned SEG26COM0              :1;
        unsigned SEG27COM0              :1;
        unsigned SEG28COM0              :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0x7AC);
// bitfield macros
#define _LCDDATA12_SEG24COM0_POSN                           0x0
#define _LCDDATA12_SEG24COM0_POSITION                       0x0
#define _LCDDATA12_SEG24COM0_SIZE                           0x1
#define _LCDDATA12_SEG24COM0_LENGTH                         0x1
#define _LCDDATA12_SEG24COM0_MASK                           0x1
#define _LCDDATA12_SEG25COM0_POSN                           0x1
#define _LCDDATA12_SEG25COM0_POSITION                       0x1
#define _LCDDATA12_SEG25COM0_SIZE                           0x1
#define _LCDDATA12_SEG25COM0_LENGTH                         0x1
#define _LCDDATA12_SEG25COM0_MASK                           0x2
#define _LCDDATA12_SEG26COM0_POSN                           0x2
#define _LCDDATA12_SEG26COM0_POSITION                       0x2
#define _LCDDATA12_SEG26COM0_SIZE                           0x1
#define _LCDDATA12_SEG26COM0_LENGTH                         0x1
#define _LCDDATA12_SEG26COM0_MASK                           0x4
#define _LCDDATA12_SEG27COM0_POSN                           0x3
#define _LCDDATA12_SEG27COM0_POSITION                       0x3
#define _LCDDATA12_SEG27COM0_SIZE                           0x1
#define _LCDDATA12_SEG27COM0_LENGTH                         0x1
#define _LCDDATA12_SEG27COM0_MASK                           0x8
#define _LCDDATA12_SEG28COM0_POSN                           0x4
#define _LCDDATA12_SEG28COM0_POSITION                       0x4
#define _LCDDATA12_SEG28COM0_SIZE                           0x1
#define _LCDDATA12_SEG28COM0_LENGTH                         0x1
#define _LCDDATA12_SEG28COM0_MASK                           0x10

